# Formatting tampilan Data Frame

## Import Modules

In [19]:
import pandas as pd
import numpy as np

print("version pandas:", pd.__version__,
      "\nversion numpy:", np.__version__)

version pandas: 2.2.3
version numpy: 2.1.3

## Persiapan Data Frame

In [20]:
n_rows = 5
n_cols = 2
cols = ['omzet', 'operasional']

df = pd.DataFrame(
    np.random.randint(1, 20, size=(n_rows, n_cols)),
    columns=cols
)

df

   omzet  operasional
0      5           10
1      7            5
2     10            1
3      5           12
4      1           15

In [21]:
df['omzet'] = df['omzet'] * 100_000
df['operasional'] = df['operasional'] * 10_000

df

     omzet  operasional
0   500000       100000
1   700000        50000
2  1000000        10000
3   500000       120000
4   100000       150000

In [22]:
df.index = pd.date_range(start='2000-01-01', periods=n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index': 'tanggal'})
df

     tanggal    omzet  operasional
0 2000-01-01   500000       100000
1 2000-01-02   700000        50000
2 2000-01-03  1000000        10000
3 2000-01-04   500000       120000
4 2000-01-05   100000       150000

## Melakukan formatting tampilan Data Frame

In [23]:
formatku = {'tanggal': '{:%d/%m/%y}',
            'omzet': 'Rp {:,.2f}',
            'operasional': 'Rp {:,.2f}'}

laporan = df.style.format(formatku)
laporan

In [24]:
type(laporan)

pandas.io.formats.style.Styler

In [30]:
laporan.hide()

In [33]:
laporan.set_caption('Data Omzet dan Operasional Harian')

In [41]:
laporan.highlight_min('omzet', color='pink')
laporan.highlight_max('operasional', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')